Revit 2024 API
StructuralSectionRectangleHSS Class
 Defines parameters for parameterized rectangle HSS structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class StructuralSectionRectangleHSS : StructuralSectionGeneralH
Visual Basic
Public Class StructuralSectionRectangleHSS _
	Inherits StructuralSectionGeneralH
Visual C++
public ref class StructuralSectionRectangleHSS : public StructuralSectionGeneralH
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralH
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangleHSS
See Also
StructuralSectionRectangleHSS Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace